In [1]:
import pandas as pd

In [3]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [8]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [13]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[10,11,12,10],'col3':[30,31,32,33]})

In [14]:
df.head()

   col1  col2  col3
0     1    10    30
1     2    11    31
2     3    12    32
3     4    10    33

In [15]:
df['col2'].unique()

array([10, 11, 12], dtype=int64)

In [17]:
df['col2'].nunique()

3

In [18]:
df['col2'].value_counts()

10    2
11    1
12    1
Name: col2, dtype: int64

In [22]:
newdf = df[(df['col1'] >3) & (df['col2'] == 10) ]

In [23]:
newdf

   col1  col2  col3
3     4    10    33

In [24]:
def times_two(number):
    return number * 2

In [25]:
times_two(4)

8

In [26]:
df

   col1  col2  col3
0     1    10    30
1     2    11    31
2     3    12    32
3     4    10    33

In [34]:
df['new'] = df['col1'].apply(times_two)

In [30]:
df

   col1  col2  col3  new
0     1    10    30    2
1     2    11    31    4
2     3    12    32    6
3     4    10    33    8

In [35]:
#or drop()
del df['new']

In [36]:
df

   col1  col2  col3
0     1    10    30
1     2    11    31
2     3    12    32
3     4    10    33

In [37]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [38]:
df.describe()

           col1       col2       col3
count  4.000000   4.000000   4.000000
mean   2.500000  10.750000  31.500000
std    1.290994   0.957427   1.290994
min    1.000000  10.000000  30.000000
25%    1.750000  10.000000  30.750000
50%    2.500000  10.500000  31.500000
75%    3.250000  11.250000  32.250000
max    4.000000  12.000000  33.000000

In [39]:
df.describe().transpose()

      count   mean       std   min    25%   50%    75%   max
col1    4.0   2.50  1.290994   1.0   1.75   2.5   3.25   4.0
col2    4.0  10.75  0.957427  10.0  10.00  10.5  11.25  12.0
col3    4.0  31.50  1.290994  30.0  30.75  31.5  32.25  33.0

In [42]:
df.sort_values('col2',ascending=False)

   col1  col2  col3
2     3    12    32
1     2    11    31
0     1    10    30
3     4    10    33